tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1936_tdd.h
#define PSS1AC0                       522
#define PSS1AC1                       523
#define CCP1AS0                       524
#define CCP1AS1                       525
#define CCP1AS2                       526
#define CCP1ASE                       527
#define PSTR1CON                      528
#define STR1A                         529
#define STR1B                         530
#define STR1C                         531
#define STR1D                         532
#define STR1SYNC                      533
#define CCPR2L                        534
#define CCPR2H                        535
#define CCP2CON                       536
#define CCP2M                         537
#define CCP2M0                        538
#define CCP2M1                        539
#define CCP2M2                        540
#define CCP2M3                        541
#define DC2B                          542
#define DC2B0                         543
#define DC2B1                         544
#define P2M                           545
#define P2M0                          546
#define P2M1                          547
#define PWM2CON                       548
#define P2DC0                         549
#define P2DC1                         550
#define P2DC2                         551
#define P2DC3                         552
#define P2DC4                         553
#define P2DC5                         554
#define P2DC6                         555
#define P2RSEN                        556
#define CCP2AS                        557
#define PSS2BD0                       558
#define PSS2BD1                       559
#define PSS2AC0                       560
#define PSS2AC1                       561
#define CCP2AS0                       562
#define CCP2AS1                       563
#define CCP2AS2                       564
#define CCP2ASE                       565
#define PSTR2CON                      566
#define STR2A                         567
#define STR2B                         568
#define STR2C                         569
#define STR2D                         570
#define STR2SYNC                      571
#define CCPTMRS0                      572
#define C1TSEL0                       573
#define C1TSEL                        574
#define C1TSEL1                       575
#define C2TSEL0                       576
#define C2TSEL                        577
#define C2TSEL1                       578
#define C3TSEL0                       579
#define C3TSEL                        580
#define C3TSEL1                       581
#define C4TSEL                        582
#define C4TSEL0                       583
#define C4TSEL1                       584
#define CCPTMRS1                      585
#define C5TSEL                        586
#define C5TSEL0                       587
#define C5TSEL1                       588
#define CCPR3L                        589
#define CCPR3H                        590
#define CCP3CON                       591
#define CCP3M0                        592
#define CCP3M1                        593
#define CCP3M2                        594
#define CCP3M3                        595
#define DC3B0                         596
#define DC3B1                         597
#define P3M0                          598
#define P3M1                          599
#define PWM3CON                       600
#define P3DC0                         601
#define P3DC1                         602
#define P3DC2                         603
#define P3DC3                         604
#define P3DC4                         605
#define P3DC5                         606
#define P3DC6                         607
#define P3RSEN                        608
#define CCP3AS                        609
#define PSS3BD0                       610
#define PSS3BD1                       611
#define PSS3AC0                       612
#define PSS3AC1                       613
#define CCP3AS0                       614
#define CCP3AS1                       615
#define CCP3AS2                       616
#define CCP3ASE                       617
#define PSTR3CON                      618
#define STR3A                         619
#define STR3B                         620
#define STR3C                         621
#define STR3D                         622
#define STR3SYNC                      623
#define CCPR4L                        624
#define CCPR4H                        625
#define CCP4CON                       626
#define CCP4M0                        627
#define CCP4M1                        628
#define CCP4M2                        629
#define CCP4M3                        630
#define DC4B0                         631
#define DC4B1                         632
#define CCPR5L                        633
#define CCPR5H                        634
#define CCP5CON                       635
#define CCP5M0                        636
#define CCP5M1                        637
#define CCP5M2                        638
#define CCP5M3                        639
#define DC5B0                         640
#define DC5B1                         641
#define IOCBP                         642
#define IOCBP0                        643
#define IOCBP1                        644
#define IOCBP2                        645
#define IOCBP3                        646
#define IOCBP4                        647
#define IOCBP5                        648
#define IOCBP6                        649
#define IOCBP7                        650
#define IOCBN0                        651
#define IOCBN                         652
#define IOCBN1                        653
#define IOCBN2                        654
#define IOCBN3                        655
#define IOCBN4                        656
#define IOCBN5                        657
#define IOCBN6                        658
#define IOCBN7                        659
#define IOCBF0                        660
#define IOCBF                         661
#define IOCBF1                        662
#define IOCBF2                        663
#define IOCBF3                        664
#define IOCBF4                        665
#define IOCBF5                        666
#define IOCBF6                        667
#define IOCBF7                        668
#define TMR4                          669
#define PR4                           670
#define T4CON                         671
#define T4CKPS0                       672
#define T4CKPS                        673
#define T4CKPS1                       674
#define TMR4ON                        675
#define T4OUTPS                       676
#define T4OUTPS0                      677
#define T4OUTPS1                      678
#define T4OUTPS2                      679
#define T4OUTPS3                      680
#define TMR6                          681
#define PR6                           682
#define T6CON                         683
#define T6CKPS0                       684
#define T6CKPS                        685
#define T6CKPS1                       686
#define TMR6ON                        687
#define T6OUTPS0                      688
#define T6OUTPS                       689
#define T6OUTPS1                      690
#define T6OUTPS2                      691
#define T6OUTPS3                      692
#define LCDCON                        693
#define LMUX0                         694
#define LMUX                          695
#define LMUX1                         696
#define CS                            697
#define CS0                           698
#define CS1                           699
#define WERR                          700
#define SLPEN                         701
#define LCDEN                         702
#define LCDPS                         703
#define LP                            704
#define LP0                           705
#define LP1                           706
#define LP2                           707
#define LP3                           708
#define WA                            709
#define LCDA                          710
#define BIASMD                        711
#define WFT                           712
#define LCDREF                        713
#define VLCD1PE                       714
#define VLCD2PE                       715
#define VLCD3PE                       716
#define LCDIRI                        717
#define LCDIRS                        718
#define LCDIRE                        719
#define LCDCST0                       720
#define LCDCST                        721
#define LCDCST1                       722
#define LCDCST2                       723
#define LCDRL                         724
#define LRLAT0                        725
#define LRLAT                         726
#define LRLAT1                        727
#define LRLAT2                        728
#define LRLBP                         729
#define LRLBP0                        730
#define LRLBP1                        731
#define LRLAP0                        732
#define LRLAP                         733
#define LRLAP1                        734
#define LCDSE0                        735
#define SE0                           736
#define SE1                           737
#define SE2                           738
#define SE3                           739
#define SE4                           740
#define SE5                           741
#define SE6                           742
#define SE7                           743
#define LCDSE1                        744
#define SE8                           745
#define SE9                           746
#define SE10                          747
#define SE11                          748
#define SE12                          749
#define SE13                          750
#define SE14                          751
#define SE15                          752
#define LCDDATA0                      753
#define SEG0COM0                      754
#define SEG1COM0                      755
#define SEG2COM0                      756
#define SEG3COM0                      757
#define SEG4COM0                      758
#define SEG5COM0                      759
#define SEG6COM0                      760
#define SEG7COM0                      761
#define LCDDATA1                      762
#define SEG8COM0                      763
#define SEG9COM0                      764
#define SEG10COM0                     765
#define SEG11COM0                     766
#define SEG12COM0                     767
#define SEG13COM0                     768
#define SEG14COM0                     769
#define SEG15COM0                     770
#define LCDDATA3                      771
#define SEG0COM1                      772
#define SEG1COM1                      773
#define SEG2COM1                      774
#define SEG3COM1                      775
#define SEG4COM1                      776
#define SEG5COM1                      777
#define SEG6COM1                      778
#define SEG7COM1                      779
#define LCDDATA4                      780
#define SEG8COM1                      781
#define SEG9COM1                      782
#define SEG10COM1                     783
#define SEG11COM1                     784
#define SEG12COM1                     785
#define SEG13COM1                     786
#define SEG14COM1                     787
#define SEG15COM1                     788
#define LCDDATA6                      789
#define SEG0COM2                      790
#define SEG1COM2                      791
#define SEG2COM2                      792
#define SEG3COM2                      793
#define SEG4COM2                      794
#define SEG5COM2                      795
#define SEG6COM2                      796
#define SEG7COM2                      797
#define LCDDATA7                      798
#define SEG8COM2                      799
#define SEG9COM2                      800
#define SEG10COM2                     801
#define SEG11COM2                     802
#define SEG12COM2                     803
#define SEG13COM2                     804
#define SEG14COM2                     805
#define SEG15COM2                     806
#define LCDDATA9                      807
#define SEG0COM3                      808
#define SEG1COM3                      809
#define SEG2COM3                      810
#define SEG3COM3                      811
#define SEG4COM3                      812
#define SEG5COM3                      813
#define SEG6COM3                      814
#define SEG7COM3                      815
#define LCDDATA10                     816
#define SEG8COM3                      817
#define SEG9COM3                      818
#define SEG10COM3                     819
#define SEG11COM3                     820
#define SEG12COM3                     821
#define SEG13COM3                     822
#define SEG14COM3                     823
#define SEG15COM3                     824
#define STATUS_SHAD                   825
#define C_SHAD                        826
#define DC_SHAD                       827
#define Z_SHAD                        828
#define WREG_SHAD                     829
#define BSR_SHAD                      830
#define PCLATH_SHAD                   831
#define FSR0L_SHAD                    832
#define FSR0H_SHAD                    833
#define FSR1L_SHAD                    834
#define FSR1H_SHAD                    835
#define STKPTR                        836
#define TOSL                          837
#define TOSH                          838

#endif // _PIC16F1936_H_
